:PROPERTIES:
:ID:       68329455-a107-477f-aca8-9e2c238968ce
:END:
#+TITLE: Orange Pi: rkdeveloptool without sudo
#+CATEGORY: slips
#+TAGS:  

**** Base RK35888

#+begin_src shell :results output verbatim code :wrap example conf
cat $obtmp/rkbin/RKBOOT/RK3588MINIALL.ini
#+end_src

#+RESULTS:
#+begin_example conf
[CHIP_NAME]
NAME=RK3588
[VERSION]
MAJOR=1
MINOR=11
[CODE471_OPTION]
NUM=1
Path1=bin/rk35/rk3588_ddr_lp4_2112MHz_lp5_2400MHz_v1.19.bin
Sleep=1
[CODE472_OPTION]
NUM=1
Path1=bin/rk35/rk3588_usbplug_v1.11.bin
[LOADER_OPTION]
NUM=2
LOADER1=FlashData
LOADER2=FlashBoot
FlashData=bin/rk35/rk3588_ddr_lp4_2112MHz_lp5_2400MHz_v1.19.bin
FlashBoot=bin/rk35/rk3588_spl_v1.13.bin
[OUTPUT]
PATH=rk3588_spl_loader_v1.19.113.bin
[SYSTEM]
NEWIDB=true
[FLAG]
471_RC4_OFF=true
RC4_OFF=true
[BOOT1_PARAM]
WORD_0=0x0
WORD_1=0x0
WORD_2=0x0
WORD_3=0x0
WORD_4=0x0
WORD_5=0x0
WORD_6=0x0
WORD_7=0x0
#+end_example

***** IPC

#+begin_src shell :results output verbatim code :wrap example diff
diff $obtmp/rkbin/RKBOOT/RK3588MINIALL{,_IPC}.ini
#+end_src

#+RESULTS:
#+begin_example diff
20c20,21
< PATH=rk3588_spl_loader_v1.19.113.bin
---
> PATH=rk3588_download_v1.19.113.bin
> IDB_PATH=rk3588_idblock_v1.19.113.img
25a27
> CREATE_IDB=true
#+end_example

***** PCIE_EP

#+begin_src shell :results output verbatim code :wrap example diff
diff $obtmp/rkbin/RKBOOT/RK3588MINIALL{,_PCIE_EP}.ini
#+end_src

#+RESULTS:
#+begin_example diff
17,18c17,18
< FlashData=bin/rk35/rk3588_ddr_lp4_2112MHz_lp5_2400MHz_v1.19.bin
< FlashBoot=bin/rk35/rk3588_spl_v1.13.bin
---
> FlashData=bin/rk35/rk3588_pcie_v2.20.bin
> FlashBoot=bin/rk35/rk3588_pcie_v2.20.bin
20c20
< PATH=rk3588_spl_loader_v1.19.113.bin
---
> PATH=rk3588_pcie_loader_v2.20.bin
26,34c26
< [BOOT1_PARAM]
< WORD_0=0x0
< WORD_1=0x0
< WORD_2=0x0
< WORD_3=0x0
< WORD_4=0x0
< WORD_5=0x0
< WORD_6=0x0
< WORD_7=0x0
---
> CREATE_IDB=true
#+end_example

***** RAMBOOT

Nics.... =null{0,1}.bin=

#+begin_src shell :results output verbatim code :wrap example diff
diff $obtmp/rkbin/RKBOOT/RK3588MINIALL{,_RAMBOOT}.ini
#+end_src

#+RESULTS:
#+begin_example diff
5c5
< MINOR=11
---
> MINOR=6
12c12
< Path1=bin/rk35/rk3588_usbplug_v1.11.bin
---
> Path1=bin/rk35/rk3588_ramboot_v1.06.bin
17,18c17,18
< FlashData=bin/rk35/rk3588_ddr_lp4_2112MHz_lp5_2400MHz_v1.19.bin
< FlashBoot=bin/rk35/rk3588_spl_v1.13.bin
---
> FlashData=bin/rk35/rk3588_ramboot_null0.bin
> FlashBoot=bin/rk35/rk3588_ramboot_null1.bin
20c20
< PATH=rk3588_spl_loader_v1.19.113.bin
---
> PATH=rk3588_ramboot_loader_v1.19.106.bin
26,34d25
< [BOOT1_PARAM]
< WORD_0=0x0
< WORD_1=0x0
< WORD_2=0x0
< WORD_3=0x0
< WORD_4=0x0
< WORD_5=0x0
< WORD_6=0x0
< WORD_7=0x0
#+end_example


**** PCIe Subsystem

It can be missing, apparently. That, or =rkdeveloptool= doesn't know where it is

#+begin_src shell
find /sys/devices/pci0000\:00/ -name 'subsystem' | tree --fromfile .
#+end_src

Maybe it's good that I didn't grant this tool ... um sudo? for system stability
reason? to be fair, i did build their =rkbin= SDL loader image (kinda dumb)

The USB devices should be at =PCI= bus addresses like these... specifically
somewhere in =usb5=

#+begin_src shell :results output verbatim code :wrap verse 
find /sys/devices/pci0000\:00/0000:00:08.1 -type d -name 'usb*' | tree --fromfile .
#+end_src

#+RESULTS:
#+begin_verse
.
└── sys
    └── devices
        └── pci0000:00
            └── 0000:00:08.1
                └── 0000:0d:00.3
                    ├── usb5
                    │   └── 5-0:1.0
                    │       ├── usb5-port1
                    │       ├── usb5-port2
                    │       ├── usb5-port3
                    │       └── usb5-port4
                    └── usb6
                        └── 6-0:1.0
                            ├── usb6-port1
                            ├── usb6-port2
                            ├── usb6-port3
                            └── usb6-port4

10 directories, 8 files
#+end_verse
